import React, { useState } from "react";
import { View, Text } from "react-native";
import mainStyles from "../../constants/mainStyles";

type Props = {};

const Treatments = (props: Props) => {
  const [treatments, setTreatments] = useState<string>("");

  const generateTreatments = (percentage: number, disease: string) => {
    if (disease === "blister_blight") {
      switch (true) {
        case percentage <= 20 && percentage > 10:
          return (
            <Text>
              බිබිලි අංගමාරයෙන් 20% ක හානියකදී, ආසාදනය සාපේක්ෂව අඩුය. ඔබට පහත
              ක්‍රියාමාර්ග ගත හැකිය: කප්පාදු කිරීම සහ සනීපාරක්ෂාව: බලපෑමට ලක් වූ
              කොළ, කඳන් සහ අතු කපා ඉවත් කරන්න. කප්පාදු කරන ලද ද්රව්ය නිසි ලෙස
              බැහැර කරන්න. දිලීර නාශක: නිෂ්පාදකයාගේ උපදෙස් අනුගමනය කරමින්
              වැළැක්වීමේ පියවරක් ලෙස හෝ අවශ්‍ය පරිදි නිර්දේශිත දිලීර නාශක
              යොදන්න. සංස්කෘතික පිළිවෙත්: තේ පඳුරු සහ සෙවන කළමනාකරණය අතර නිසි
              පරතරයක් පවත්වා ගන්න. කාලෝචිත දිලීර නාශක යෙදීම් සඳහා කාලගුණික
              තත්ත්වයන් සහ රෝග ඇතිවීම නිරීක්ෂණය කරන්න.
            </Text>
          );
        case percentage <= 40 && percentage > 20:
          return (
            <Text>
              බ්ලිස්ටර් අංගමාරය හානිය 40% දක්වා ළඟා වූ විට, වඩාත් ක්‍රියාශීලී
              වීම අත්‍යවශ්‍ය වේ: කප්පාදු කිරීම සහ සනීපාරක්ෂාව: බලපෑමට ලක් වූ ශාක
              කොටස් ඉවත් කිරීම සඳහා නිතිපතා කප්පාදු කිරීම සහ සනීපාරක්ෂාව දිගටම
              කරගෙන යන්න. දිලීර නාශක: නිර්දේශ අනුව දිලීර නාශක යෙදීම් වාර ගණන
              වැඩි කරන්න. අවදානමට ලක්විය හැකි සියලුම ශාක කොටස් හොඳින් ආවරණය කර
              ඇති බවට සහතික වන්න. සංස්කෘතික පිළිවෙත්: හොඳ වායු සංසරණයක් සහ නිසි
              සෙවන කළමනාකරණයක් පවත්වා ගැනීමට උත්සාහයන් තීව්‍ර කරන්න.
            </Text>
          );
        case percentage <= 60 && percentage > 40:
          return (
            <Text>
              60% ක හානියකදී, බිබිලි අංගමාරය සැලකිය යුතු අවධානයක් යොමු කරයි:
              කප්පාදු කිරීම සහ සනීපාරක්ෂාව: ආසාදිත ද්‍රව්‍ය ඉවත් කිරීමට සහ බැහැර
              කිරීමට උනන්දු වන්න. රෝගයේ මූලාශ්රය අඩු කිරීම සඳහා වඩාත් ආක්රමණශීලී
              කප්පාදු කිරීම සලකා බලන්න. දිලීර නාශක: නිතිපතා සහ හොඳින් කාලානුරූපී
              දිලීර නාශක යෙදීම් දිගටම කරගෙන යන්න. ප්රතිරෝධය වැළැක්වීම සඳහා විවිධ
              දිලීර නාශක අතර කරකවන්න. සංස්කෘතික පිළිවෙත්: අවශ්‍ය පරිදි සෙවන
              කළමනාකරණය සමාලෝචනය කර සකස් කරන්න. පඳුරු අධික ලෙස පිරී නොයන බවට වග
              බලා ගන්න.
            </Text>
          );
        case percentage <= 80 && percentage > 60:
          return (
            <Text>
              80% ක හානියක් සමඟ, තත්වය තීරණාත්මක වන අතර ආක්‍රමණශීලී පියවර අවශ්‍ය
              වේ: කප්පාදු කිරීම සහ සනීපාරක්ෂාව: දැඩි ලෙස කප්පාදු කරන්න, අවශ්ය
              නම් දැඩි ලෙස බලපෑමට ලක් වූ පඳුරු ඉවත් කරන්න. කප්පාදු කරන ලද සියලුම
              ද්‍රව්‍ය නිසි ලෙස බැහැර කර ඇති බවට සහතික වන්න. දිලීර නාශක: දිලීර
              නාශක යෙදීම් දිගටම කරගෙන යන්න සහ නිතර යෙදීම සලකා බලන්න. විශේෂිත
              දිලීර නාශක නිර්දේශ සඳහා විශේෂඥයෙකුගෙන් විමසන්න. නැවත සිටුවීම: දැඩි
              ලෙස බලපෑමට ලක් වූ ප්‍රදේශ බිබිලි අංගමාරයට ප්‍රතිරෝධී තේ ප්‍රභේද
              සමඟ නැවත වගා කිරීම සලකා බලන්න.
            </Text>
          );
        case percentage <= 100 && percentage > 80:
          return (
            <Text>
              100% හානියක් වන විට, තේ වගාවට දැඩි ලෙස බලපා ඇත: නැවත සිටුවීම:
              සම්පූර්ණ විනාශයකදී, හානියට පත් මුළු ප්‍රදේශයම ප්‍රතිරෝධී තේ
              ප්‍රභේද සමඟ නැවත සිටුවීමට අවශ්‍ය විය හැකිය. නව වගාව සඳහා ස්ථානය සහ
              පාංශු තත්ත්වය නැවත ඇගයීම. අඛණ්ඩ අධීක්ෂණය: නැවත සිටුවීමෙන් පසුව
              පවා, බිබිලි අංගමාරය පිළිබඳ යම් සලකුණු නිරීක්ෂණය කිරීම සහ දැඩි
              වැළැක්වීමේ පියවරයන් ක්රියාත්මක කිරීම දිගටම කරගෙන යන්න. ඔබේ නිශ්චිත
              ස්ථානය, දේශගුණය සහ තේ ප්‍රභේදය අනුව බිබිලි අංගමාරය කළමනාකරණය වෙනස්
              විය හැකි බව මතක තබා ගන්න. ඔබගේ තත්වයන් මත පදනම්ව සකස් කරන ලද
              මාර්ගෝපදේශ සහ නිර්දේශ සඳහා දේශීය කෘෂිකාර්මික විශේෂඥයින් සමඟ
              සාකච්ඡා කරන්න.
            </Text>
          );
        default:
          return <Text>Not a big damage</Text>;
      }
    } else if (disease === "stem_canker" || disease === "bark_canker") {
      switch (true) {
        case percentage <= 20 && percentage > 10:
          return (
            <Text>
              කඳ සහ අතු පිළිකා වලින් 20% ක හානියකදී, ඔබට පහත ක්‍රියාමාර්ග ගත
              හැකිය: 1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව: • බලපෑමට ලක් වූ කඳන් සහ
              අතු කපා ඉවත් කරන්න. • තවදුරටත් පැතිරීම වැළැක්වීම සඳහා කප්පාදු කරන
              ලද ද්රව්ය නිසි ලෙස බැහැර කරන්න. 2. දිලීර නාශක: • නිෂ්පාදකයාගේ
              උපදෙස් අනුගමනය කරමින් වැළැක්වීමේ පියවරක් ලෙස හෝ අවශ්‍ය පරිදි
              නිර්දේශිත දිලීර නාශක යොදන්න. 3. සංස්කෘතික පිළිවෙත්: • වායු සංසරණය
              ප්රවර්ධනය කිරීම සහ ආර්ද්රතාවය අඩු කිරීම සඳහා තේ පඳුරු අතර නිසි
              පරතරයක් පවත්වා ගන්න. • කාලෝචිත දිලීර නාශක යෙදීම් සඳහා කාලගුණික
              තත්ත්වයන් සහ රෝග ඇතිවීම නිරීක්ෂණය කරන්න.
            </Text>
          );
        case percentage <= 40 && percentage > 20:
          return (
            <Text>
              කඳ සහ අතු පිළිකා හානිය 40% දක්වා ළඟා වූ විට, වඩාත් ක්‍රියාශීලී වීම
              අත්‍යවශ්‍ය වේ: 1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව: • බලපෑමට ලක් වූ
              ශාක කොටස් ඉවත් කිරීම සඳහා නිතිපතා කප්පාදු කිරීම සහ සනීපාරක්ෂාව
              දිගටම කරගෙන යන්න. • රෝගයේ මූලාශ්රය අඩු කිරීම සඳහා වඩාත් ආක්රමණශීලී
              කප්පාදු කිරීම සලකා බලන්න. 2. දිලීර නාශක: • නිර්දේශ අනුව දිලීර නාශක
              යෙදීම් වාර ගණන වැඩි කරන්න. • අවදානමට ලක්විය හැකි සියලුම ශාක කොටස්
              හොඳින් ආවරණය කර ඇති බවට සහතික වන්න. 3. සංස්කෘතික පිළිවෙත්: • හොඳ
              වායු සංසරණයක් සහ නිසි සෙවන කළමනාකරණයක් පවත්වා ගැනීමට උත්සාහයන්
              තීව්‍ර කරන්න. • ශාක සෞඛ්‍යය ප්‍රවර්ධනය කිරීම සඳහා ඔබේ පොහොර යෙදීම
              සහ වාරිමාර්ග පිළිවෙත් සමාලෝචනය කර සකස් කරන්න.
            </Text>
          );
        case percentage <= 60 && percentage > 40:
          return (
            <Text>
              60% ක හානියකදී, කඳ සහ අතු පිළිකා සැලකිය යුතු අවධානයක් යොමු කරයි:
              1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව: • ආසාදිත ද්‍රව්‍ය ඉවත් කිරීමට සහ
              බැහැර කිරීමට උනන්දු වන්න. • දැඩි ලෙස බලපෑමට ලක් වූ අතු ඉවත් කිරීම
              කෙරෙහි අවධානය යොමු කරමින් වඩාත් පුළුල් කප්පාදු කිරීම සලකා බලන්න.
              2. දිලීර නාශක: • නිතිපතා සහ හොඳින් කාලානුරූපී දිලීර නාශක යෙදීම්
              දිගටම කරගෙන යන්න. • ප්රතිරෝධය වැළැක්වීම සඳහා විවිධ දිලීර නාශක අතර
              කරකවන්න. 3. සංස්කෘතික පිළිවෙත්: • අවශ්‍ය පරිදි සෙවන කළමනාකරණය
              සමාලෝචනය කර සකස් කරන්න. • පාංශු පරීක්ෂාව සිදු කර ශාක ශක්තිය වැඩි
              කිරීම සඳහා අවශ්‍ය පරිදි පස සංශෝධනය කරන්න.
            </Text>
          );
        case percentage <= 80 && percentage > 60:
          return (
            <Text>
              80% ක හානියක් සමඟ, තත්වය තීරණාත්මක වන අතර ආක්‍රමණශීලී පියවර අවශ්‍ය
              වේ: 1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව: • දැඩි ලෙස කප්පාදු කරන්න,
              දැඩි ලෙස බලපෑමට ලක් වූ අතු සහ කඳන් ඉවත් කරන්න. • කප්පාදු කරන ලද
              සියලුම ද්‍රව්‍ය නිසි ලෙස බැහැර කර ඇති බවට සහතික වන්න. 2. දිලීර
              නාශක: • දිලීර නාශක යෙදීම් දිගටම කරගෙන යන්න සහ නිතර යෙදීම සලකා
              බලන්න. • විශේෂිත දිලීර නාශක නිර්දේශ සඳහා විශේෂඥයෙකුගෙන් විමසන්න.
              3. නැවත සිටුවීම: • දැඩි ලෙස බලපෑමට ලක් වූ ප්‍රදේශ කඳ සහ අතු පිළිකා
              වලට වඩා ප්‍රතිරෝධී විය හැකි තේ ප්‍රභේද සමඟ නැවත වගා කිරීම සලකා
              බලන්න.
            </Text>
          );
        case percentage <= 100 && percentage > 80:
          return (
            <Text>
              100% හානියක් වන විට, තේ වගාවට දැඩි ලෙස බලපා ඇත: 1. නැවත සිටුවීම: •
              සම්පූර්ණ විනාශයකදී, රෝගයට ඔරොත්තු දෙන තේ වර්ග සමඟ සම්පූර්ණ බලපෑමට
              ලක් වූ ප්රදේශය නැවත සිටුවීමට අවශ්ය විය හැකිය. • නව වගාව සඳහා
              ස්ථානය සහ පාංශු තත්ත්වය නැවත ඇගයීම. 2. අඛණ්ඩ අධීක්ෂණය: • නැවත
              සිටුවීමෙන් පසුව පවා, කඳේ සහ අතු පිළිකා ඇතිවීමේ සලකුණු නිරීක්ෂණය
              කිරීම සහ දැඩි වැළැක්වීමේ පියවරයන් ක්රියාත්මක කිරීම දිගටම කරගෙන
              යන්න. • බිබිලි අංගමාරය මෙන්ම, කඳ සහ අතු පිළිකා කළමනාකරණය ඔබේ
              නිශ්චිත ස්ථානය, දේශගුණය සහ තේ ප්‍රභේදය අනුව වෙනස් විය හැක. ඔබගේ
              තත්වයන් මත පදනම්ව සකස් කරන ලද මාර්ගෝපදේශ සහ නිර්දේශ සඳහා දේශීය
              කෘෂිකාර්මික විශේෂඥයින් සමඟ සාකච්ඡා කරන්න.
            </Text>
          );
        default:
          return <Text>Not a big damage</Text>;
      }
    } else if (disease === "insect") {
      switch (percentage) {
        case 1:
          return (
            <Text>
              50% ක හානියක් සිදුරු සිදුරු කරන්නන්ගෙන්, උවදුර තරමක් දරුණු වේ. පහත
              ක්‍රියාමාර්ග ගන්න: 1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව: • බලපෑමට ලක්
              වූ අතු කපා ඉවත් කරන්න. • තවදුරටත් පැතිරීම වැළැක්වීම සඳහා ආසාදිත
              දැව නිසි ලෙස බැහැර කරන්න. 2. කෘමිනාශක: • නිෂ්පාදකයාගේ උපදෙස් පරිදි
              වෙඩි සිදුරු විදින පාලනය සඳහා නිර්දේශිත කෘමිනාශක යොදන්න. • බලපෑමට
              ලක් වූ ප්රදේශ හොඳින් ආවරණය කිරීම සහතික කිරීම. 3. අධීක්ෂණය: • නව
              ආසාදනවල සලකුණු සඳහා ගස් අඛණ්ඩව නිරීක්ෂණය කරන්න. • අවශ්‍ය පරිදි
              කෘමිනාශක යෙදීම් සඳහා විධිමත් කාලසටහනක් පවත්වා ගන්න.
            </Text>
          );
        case 2:
          return (
            <Text>
              75% ක හානියකදී, වෙඩි කුහරය විදින උවදුර වඩාත් දරුණු වන අතර, ඔබ
              වඩාත් ආක්‍රමණශීලී පියවර ගත යුතුය: 1. කප්පාදු කිරීම සහ සනීපාරක්ෂාව:
              • ආසාදිත දැව ඉවත් කිරීම, කප්පාදු කිරීම සහ සනීපාරක්ෂක කටයුතු දිගටම
              කරගෙන යන්න. • බලපෑමට ලක් වූ අතු සහ අත් පා හඳුනා ගැනීම සහ
              ආමන්ත්‍රණය කිරීමේදී වඩාත් හොඳින් කටයුතු කරන්න. 2. කෘමිනාශක: •
              කෘමිනාශක යෙදීම් වාර ගණන වැඩි කරන්න. • විශේෂිත උපදෙස් සහ කෘමිනාශක
              නිර්දේශ සඳහා දේශීය පළිබෝධ කළමනාකරණ විශේෂඥයින් සමඟ සාකච්ඡා කරන්න.
              3. අධීක්ෂණය: • ඕනෑම නව ආක්‍රමණයක් ඉක්මනින් හඳුනා ගැනීමට
              සුපරීක්ෂාකාරී අධීක්ෂණයක් පවත්වා ගන්න. • වැඩිහිටි වෙඩි සිදුරු
              සිදුරු කරන්නන් නිරීක්ෂණය කිරීමට සහ උගුලට හසු කර ගැනීමට උගුල් හෝ
              ෆෙරමෝන් මත පදනම් වූ ක්‍රම භාවිතා කිරීම සලකා බලන්න.
            </Text>
          );
        case 3:
          return (
            <Text>
              ඔබට වෙඩි සිදුරු සිදුරු කරන්නන්ගෙන් 100% හානියක් සිදු වූ විට,
              ආසාදනය දරුණු වන අතර, ඔබට දැඩි ක්‍රියාමාර්ග ගැනීමට අවශ්‍ය විය
              හැකිය: 1. ඉවත් කිරීම සහ ප්රතිස්ථාපනය කිරීම: • දැඩි ලෙස බලපෑමට ලක්
              වූ සියලුම ගස් සහ දැව ඉවත් කරන්න. • සිදුරු සිදුරු කරන්නන්ට අඩු
              අවදානමක් ඇති ගස් විශේෂ සමඟ නැවත වගා කිරීම සලකා බලන්න. 2.
              වැළැක්වීමේ පියවර: • නව ගස් මත කෘමිනාශක යෙදීම හෝ සිදුරු වැලැක්වීම
              සඳහා භෞතික බාධක ස්ථාපනය කිරීම වැනි වැළැක්වීමේ පියවරයන් ක්‍රියාත්මක
              කරන්න. • වෙඩි සිදුරු සිදුරු කරන්නන් ආකර්ෂණය කරන විභව ධාරක ගස්
              වලින් ප්‍රදේශය නිදහස් කරන්න. 3. වෘත්තීය උපකාර: • දරුණු වෙඩි සිදුරු
              විදින උවදුරු පාලනය කිරීමේදී පළපුරුදු ගස්වැල්කරුවන් හෝ පළිබෝධ පාලන
              වෘත්තිකයන්ගෙන් උපදෙස් ලබා ගන්න 4. අඛණ්ඩ අධීක්ෂණය සහ අධ්‍යාපනය: •
              දැඩි ක්‍රියාමාර්ග ගැනීමෙන් පසුව වුවද, වෙඩි සිදුරු සිදුරු කරන්නන්ගේ
              යම් සලකුණු තිබේදැයි ප්‍රදේශය නිරීක්ෂණය කිරීම දිගටම කරගෙන යන්න. •
              අනාගත ආසාදන වැලැක්වීම සඳහා වැළැක්වීම සහ කලින් හඳුනා ගැනීම පිළිබඳව
              ඔබේ ප්‍රජාව තුළ අන් අය දැනුවත් කරන්න. • විශේෂිත ගස් විශේෂ සහ
              ප්‍රාදේශීය තත්ත්වයන් අනුව වෙඩි සිදුරු විදින උවදුරු පාලනය කිරීම
              වෙනස් විය හැකි බව කරුණාවෙන් සලකන්න. ඔබගේ තත්වයන් මත පදනම්ව සකස්
              කරන ලද මාර්ගෝපදේශ සහ නිර්දේශ සඳහා ප්‍රාදේශීය කෘෂිකාර්මික බලධාරීන්
              හෝ පළිබෝධ කළමනාකරණ විශේෂඥයින් සමඟ සමීපව කටයුතු කිරීම අත්‍යවශ්‍ය
              වේ.
            </Text>
          );
        default:
          return <Text>Not a big damage</Text>;
      }
    }
  };
  return (
    <View style={mainStyles.main}>
      {generateTreatments(2, "insect")}
    </View>
  );
};

export default Treatments;
