export const diseaseDetails = [
  {
    name: "බුබුලු අංගමාරය",
    category: "දිලීර රෝග",
    symptoms:
      "බිබිලි වැනි තුවාල, පත්‍ර විරූපණය, ප්‍රභාසංස්ලේෂණය අඩු වීම, අඩු වූ ගුණාත්මකභාවය, අකලට පත්‍ර වැටීම",
    treatment: "Rest, Fluids, Medical Care",
    description:
      "තේ පැලවල බහුලව දක්නට ලැබෙන දිලීර රෝගයක් වන බුබුලු අංගමාරය (Blister Blight) ශ්‍රී ලංකාවේ ගොවීන්ට සැලකිය යුතු අභියෝගයක් එල්ල කරයි. ඵලදායී කළමනාකරණය සඳහා එහි රෝග ලක්ෂණ හඳුනා ගැනීම ඉතා වැදගත් වේ. ඉහළ පත්‍ර මතුපිට ඇති බිබිලි වැනි තුවාල වලින් සංලක්ෂිත වන මෙම කහ සිට රතු-දුඹුරු දක්වා වූ සැකැස්මට පත්‍ර විකෘති කළ හැකි අතර ඒවායේ ගුණාත්මක භාවය අඩු කර නිෂ්පාදනය කරන තේවල වටිනාකමට බලපායි. දරුණු අවස්ථා අකලට පත්‍ර වැටීමට හේතු විය හැකි අතර ශාක වර්ධනයට බාධා ඇති කරයි, විශේෂයෙන් තරුණ තේ පැල වලට බලපායි. මීට අමතරව, මෙම රෝගය ප්‍රභාසංශ්ලේෂණයට බාධා කරයි, ශාක සෞඛ්‍යය තවදුරටත් අවදානමට ලක් කරයි. Blister Blight හි බලපෑම අවම කිරීම සඳහා ගොවීන් බහුවිධ ප්‍රවේශයක් අනුගමනය කළ යුතුය. ආසාදිත කොටස් කප්පාදු කිරීම වැනි කඩිනම් ක්‍රියාමාර්ග ගැනීමට හැකි වන පරිදි, කලින් හඳුනා ගැනීම සඳහා නිතිපතා පරීක්ෂා කිරීම් ඉතා වැදගත් වේ. නිසි ශාක පරතරය සහ සනීපාරක්ෂාව නඩත්තු කිරීම රෝග වර්ධනය අධෛර්යමත් කරන අතර විශේෂඥ මගපෙන්වීම යටතේ දිලීර නාශක යෙදීම ප්‍රයෝජනවත් බව ඔප්පු කළ හැකිය. ප්‍රතිරෝධී තේ වගාවන් තෝරා ගැනීම සහ දේශීය කෘෂිකාර්මික ව්‍යාප්ති සේවාවන්ගෙන් උපදෙස් ලබා ගැනීම ගොවීන්ට තම තේ වගාවන් සක්‍රීයව ආරක්ෂා කර ගැනීමටත්, ඵලදායී හා සෞඛ්‍ය සම්පන්න අස්වැන්නක් සහතික කිරීමටත් හැකියාව ලැබේ.",
    images: [
      require("../assets/Diseases/blister-blight.jpg"),
      require("../assets/Diseases/2.jpg"),
    ],
  },
  {
    name: "කඳ අතු පිළිකාව",
    category: "දිලීර රෝග",
    symptoms:
      "දිරාපත්වීම, කොළ කහ වීම සහ මැලවීම, පිළිකා තුවාල, අඩු වූ අස්වැන්න, බීජාණු නිෂ්පාදනය, දුර්වලතාවය සහ කැඩීම",
    treatment: "Rest, Fluids, Antiviral Medications",
    description:
      "'Phomopsis theae' මගින් ඇති කරන දිලීර රෝගයක් වන කඳ අතු පිළිකාව (Stem and Branch Canker) ශ්‍රී ලංකාවේ තේ පැල සඳහා සැලකිය යුතු තර්ජනයක් එල්ල කරයි. මෙම රෝගය කඳන් සහ අතු මත ගිලුණු, තද දුඹුරු සිට කළු පැහැති පිළිකා සහිත තුවාල ලෙස විදහා දක්වයි, බොහෝ විට කොළ මැකී යාම, කහ වීම සහ මැලවීම සිදු කරයි. බලපෑමට ලක් වූ අතු දුර්වල වී බිඳෙනසුලු වී, ශාකයේ සමස්ත සෞඛ්‍යයට බාධාවක් වන අතර අස්වැන්න අඩු කරයි. දිලීර ආසාදිත පටක මත බීජාණු නිපදවයි, එහි පැතිරීම පහසු කරයි. මෙම රෝගය පාලනය කිරීම සඳහා, ආසාදිත අතු කඩිනමින් කප්පාදු කර ඉවත් කිරීම, නිසි සනීපාරක්ෂක පිළිවෙත් පවත්වා ගැනීම, විශේෂඥයින්ගේ උපදෙස් පරිදි දිලීර නාශක යෙදීම සලකා බැලීම, හොඳ ශාක පරතරයක් සහ වාතාශ්‍රයක් සහතික කිරීම සහ හැකි සෑම විටම ප්‍රතිරෝධී තේ වර්ග තෝරා ගැනීමට ගොවීන්ට උපදෙස් දෙනු ලැබේ. කඳේ සහ අතු කැන්කර්ගේ බලපෑම මැඩපැවැත්වීම, තේ වගාවන් ආරක්ෂා කිරීම සහ සෞඛ්ය සම්පන්න අස්වැන්නක් සහතික කිරීම සඳහා නිරීක්ෂණය කිරීම සහ කඩිනම් ක්රියාමාර්ග ගැනීම අත්යවශ්ය වේ.",
    images: [
      require("../assets/Diseases/steam-and-branch.jpg"),
      require("../assets/Diseases/1.png"),
    ],
  },
  {
    name: "කද ගුල්ලා",
    category: "කුරුමිණි ආසාදන",
    symptoms:
      "ඇතුල් වීමේ සිදුරු, මියයාම සහ මැලවීම, දිලීර ආසාදන, වෙඩි කුහර රටා",
    treatment: "Rest, Fluids, Medical Care",
    description:
      "'Euwallacea fornicatus' ලෙසින් හඳුනාගෙන ඇති කද ගුල්ලා (Shot Hole Borrer) යනු ශ්‍රී ලංකාවේ තේ පැල සඳහා සැලකිය යුතු තර්ජනයක් එල්ල කරන කුඩා කුරුමිණියෙකි. මෙම පළිබෝධකයාගේ පැමිණීම කඳන් සහ අතු මත කුඩා ඇතුල් වීමේ සිදුරු මගින් සලකුණු කර ඇති අතර, එයින් සිහින් sawdust වැනි පිත්තල බොහෝ විට මතු වේ. සිදුරු වල සිදුරු කිරීමේ ක්‍රියාකාරිත්වය පෝෂක හා ජල ප්‍රවාහයට බාධා ඇති කරයි, අතු මැරී යාම සහ කොළ මැලවීම සිදු කරයි. මීට අමතරව, කුරුමිණියන් ශාකයට හානිකර දිලීර හඳුන්වා දෙයි, එහි සෞඛ්යය තවදුරටත් අනතුරේ. වෙඩි තැබීම්වලට සමාන වූ සුවිශේෂී වෘත්තාකාර සිදුරු කොළ මත රටා නිර්මාණය කරයි. ෂොට් හෝල් බෝරර්ගේ බලපෑම අවම කිරීම සඳහා, ක්‍රියාකාරී පියවර ඉතා වැදගත් වේ. ආසාදිත අතු කඩිනමින් කප්පාදු කර ඉවත් කළ යුතු අතර, වැටී ඇති කොළ සහ සුන්බුන් බෝ වන ස්ථාන අවම කිරීම සඳහා පිරිසිදු කළ යුතු අතර, විශේෂඥ මගපෙන්වීම යටතේ සුදුසු කෘමිනාශක යෙදිය යුතුය. ප්‍රතිරෝධී තේ වගාවන් තෝරා ගැනීම සහ විවිධ පළිබෝධ කළමනාකරණ ප්‍රවේශයන් ඒකාබද්ධ කිරීම ද නිර්දේශ කෙරේ. කලින් හඳුනා ගැනීම සහ ඵලදායී පාලනය සඳහා ඇතුල් වීමේ සිදුරු, පිත්තල සහ වෙනත් සලකුණු සඳහා නිතිපතා අධීක්ෂණය කිරීම අත්යවශ්ය වේ. සුපරීක්ෂාකාරීව සිටීමෙන් සහ පුළුල් උපාය මාර්ග ක්‍රියාත්මක කිරීමෙන් තේ ගොවීන්ට කද ගුල්ලාගේ අහිතකර බලපෑම්වලින් තම වගාවන් වඩාත් හොඳින් ආරක්ෂා කර ගනිමින් සෞඛ්‍ය සම්පන්න තේ නිෂ්පාදනයක් පවත්වා ගත හැකිය.",
    images: [
      require("../assets/Diseases/Shot-Hole-Borer.jpg"),
      require("../assets/Diseases/2.jpg"),
    ],
  },
  {
    name: "රතු මකුළු මයිටා",
    category: "කුරුමිණි ආසාදන",
    symptoms: "පත්‍ර දුර්වර්ණ වීම, සිහින් දැල්, පත්‍ර රැලිවීම සහ මැලවීම, අඩු ප්‍රභාසංස්ලේෂණය",
    treatment: "Rest, Fluids, Antiviral Medications",
    description:
      "ශ්‍රී ලංකාවේ තේ වතුවල බහුලව දක්නට ලැබෙන රතු මකුළු මයිටා (Red Spider Mite), තේ පැලවල සෞඛ්‍යයට සැලකිය යුතු තර්ජනයක් එල්ල කරයි. 'Tetranychidae' කුලයට අයත් මෙම කුඩා අරක්නිඩ් වර්ග තේ දළුවල යටි පැත්ත ආහාරයට ගැනීමෙන් හානි සිදු කරයි. ආක්‍රමණයේ ප්‍රථම ලක්ෂණ වන්නේ කොළ මත කුඩා කහ පැහැති ලප වන අතර එය ලෝකඩ හෝ රතු පැහැයක් දක්වා වර්ධනය විය හැක. විශේෂයෙන් ආක්‍රමණ උග්‍ර වූ විට සුවිශේෂී සිහින් සේද දැල් දිස්විය හැක. පෝෂණය නිසා කොළ මත කුඩා සුදු හෝ කහ පැල්ලම් ඇති වන අතර එය විශාල දුර්වර්ණ ප්‍රදේශවලට ඒකාබද්ධ විය හැකිය. ආසාදිත පත්‍ර වක්‍ර වී, දාර දුඹුරු පැහැ වී, අකලට මැලවී යා හැක. මයිටාවන් පෝෂණය කිරීම ප්‍රභාසංශ්ලේෂණය කඩාකප්පල් කරයි, තේ පැලවල සමස්ත වර්ධනයට හා ඵලදායිතාවයට බලපායි. ඔවුන්ගේ වේගවත් ප්‍රජනනය සැලකිල්ලට ගෙන, රතු මකුළු මයිටාවන් ඉක්මනින් වර්ධනය විය හැක, විශේෂයෙන් උණුසුම් හා වියලි තත්වයන් තුළ. ඵලදායි කළමනාකරණයට ජලය ඉසීම, විලෝපික මයිටාවන් හඳුන්වා දීම, නෙම් තෙල් මත පදනම් වූ ද්‍රාවණ භාවිතා කිරීම, උද්‍යාන විද්‍යාත්මක තෙල් යෙදීම සහ අවශ්‍ය නම් විචක්ෂණශීලී ඇකරයිසයිඩ් භාවිතය ඇතුළත් වේ. මෙම ක්‍රම මනා සංස්කෘතික භාවිතයන් සමඟ ඒකාබද්ධ කිරීම සහ කල් ඇතිව මැදිහත් වීමෙන් ශ්‍රී ලංකාවේ තේ වගාවන් රතු මකුළු මයිටා උවදුරේ හානිකර බලපෑම් වලින් ආරක්ෂා කර ගත හැකි අතර තේ බෝගවල සෞඛ්‍යය හා ජීව ගුණය ආරක්ෂා කර ගත හැක.",
    images: [
      require("../assets/Diseases/Red-Spider-mite.jpg"),
      require("../assets/Diseases/1.png"),
    ],
  },
  {
    name: "තේ මදුරු මකුනා",
    category: "කුරුමිණි ආසාදන",
    symptoms: "රිකිලි මැලවීම, නොමේරූ පත්‍ර වැටීම, රිකිලි වර්ධනය අඩු වීම, පත්‍ර දැවීම, පත්‍ර රැලිවීම",
    treatment: "Rest, Fluids, Medical Care",
    description:
      "ශ්‍රී ලංකාවේ තේ වගාවේ කැපී පෙනෙන පළිබෝධයක් වන තේ මදුරු මකුනා - Tea Mosquito Bug (Helopeltis spp.) තේ පැලවල සෞඛ්‍යයට සැලකිය යුතු තර්ජනයක් එල්ල කරයි. මෙම දෝෂයන් තරුණ තේ රිකිලි මත යුෂ-පෝෂණය කිරීමේ හැසිරීම සඳහා ප්‍රසිද්ධ වී ඇති අතර එය රෝග ලක්ෂණ ගණනාවක් ඇති කරයි. ආසාදිත රිකිලි මැලවී මැලවී යාමේ ප්‍රවණතාවක් ඇති අතර, එය මකුණන්ගේ සිදුරු පෝෂණ විලාසය පෙන්නුම් කරයි. පත්‍ර ඒවායේ ඉඟි සහ දාරවල පිළිස්සීම් පෙන්නුම් කළ හැකි අතර දෝෂ ක්‍රියාකාරකම්වලට ප්‍රතිචාර වශයෙන් රැලි ගැසීම සිදු විය හැක. මකුණන්ගේ පෝෂණ ක්‍රියාකාරකම් රිකිලි වර්ධනයට බාධා කරයි, ශාකයේ සමස්ත ජීව ශක්තියට බලපායි. යුෂ පරිභෝජනයේ ප්‍රතිඵලයක් ලෙස, මකුණන් මී පැණි ඉවත් කරයි, එය සීනි සහිත ද්‍රව්‍යයක් වන අතර එමඟින් කොළ මත ඇඹුල් පුස් වර්ධනයට දායක වේ. දරුණු අවස්ථාවල දී, ආසාදනය නොමේරූ පත්‍ර වැටීමට හේතු විය හැක, අස්වැන්න සහ ශාක සෞඛ්‍යය යන දෙකම අඩාල කරයි. මෙම පළිබෝධකයන්ගේ පැමිණීම තේ වගාවන් තුළ පරිසර පද්ධතියේ සාමාන්‍ය සමතුලිතතාවයට බාධාවක් විය හැකිය. ආසාදිත අංකුර කඩිනමින් කප්පාදු කිරීම, විශේෂඥයන්ගේ මඟපෙන්වීම අනුව සුදුසු කෘමිනාශක භාවිතය, ස්වභාවික විලෝපිකයන් ප්‍රවර්ධනය කිරීම, අභිජනන ස්ථාන අවම කිරීම සඳහා නිසි සනීපාරක්ෂාව පවත්වා ගැනීම, නිරන්තර අධීක්ෂණය සහ ඒකාබද්ධ පළිබෝධ කළමනාකරණ උපාය මාර්ග ක්‍රියාත්මක කිරීම ඇතුළුව ඵලදායී කළමනාකරණ පිළිවෙත් ඉතා වැදගත් වේ. පුළුල් ප්‍රවේශයක් අනුගමනය කිරීමෙන් තේ ගොවීන්ට ශ්‍රී ලංකාවේ තේ වතුවල ජීව ගුණය සහ ඵලදායිතාව ආරක්ෂා කර ගනිමින් තේ මදුරු උවදුරට එරෙහිව ඵලදායී ලෙස සටන් කළ හැකිය.",
    images: [
      require("../assets/Diseases/tea_mosquito_bug.jpg"),
      require("../assets/Diseases/2.jpg"),
    ],
  },
  {
    name: "Camellia Dieback",
    category: "දිලීර රෝග",
    symptoms: "මැලවී යයි, ශාඛා ඉඟි මිය යාම, කඳ මත අළු පැල්ලම්, කොළ හදිසියේම කහ පැහැයට හැරේ",
    treatment: "Rest, Fluids, Antiviral Medications",
    description:
      "ශ්‍රී ලංකාවේ තේ පැලවලට බලපාන දිලීර රෝගයක් වන Camellia Dieback සහ Canker, වතුවල සෞඛ්‍ය හා ඵලදායිතාව පිළිබඳ සැලකිය යුතු සැලකිල්ලක් දක්වයි. මෙම රෝගය කඳන් සහ අතු මත තුවාල වර්ධනය වීම මගින් සංලක්ෂිත වේ, බොහෝ විට බලපෑමට ලක් වූ ශාක කොටස් මැලවී යාම සහ මැලවීම. මෙම තුවාල ගිලුණු සහ තද වර්ණයෙන් දිස්විය හැකි අතර, ක්‍රමයෙන් විශාල වන අතර ශාකයේ ව්‍යුහාත්මක අඛණ්ඩතාවයට හානි කරයි. රෝගය වර්ධනය වන විට, එය අතු දුර්වල කරයි, එය කැඩී බිඳී යාම හා අස්වැන්න අඩු කරයි. හේතුකාරක දිලීර තුවාල හෝ ස්වාභාවික විවරයන් හරහා ආසාදනය වන අතර, බීජාණු හරහා පැතිරී උණුසුම් හා තෙතමනය සහිත තත්වයන් තුළ වර්ධනය වේ. ආසාදිත අතු කඩිනමින් කප්පාදු කිරීම සහ ඉවත් කිරීම, වාතාශ්‍රය වැඩි දියුණු කිරීම සඳහා නිසි පැල පරතරයක් පවත්වා ගැනීම, වැටුණු කොළ සහ සුන්බුන් ඉවත් කිරීමෙන් හොඳ සනීපාරක්ෂාව පිළිපැදීම සහ කෘෂිකාර්මික විශේෂඥයින් විසින් නිර්දේශ කරන පරිදි දිලීර නාශක යෙදීම ඵලදායී කළමනාකරණ උපාය මාර්ග වේ. Camellia Dieback සහ Canker මර්ධනය, තේ වගාවන් ආරක්ෂා කිරීම සහ ශ්‍රී ලංකාවේ දියුණු තේ කර්මාන්තයක් සහතික කිරීම සඳහා නිරීක්ෂණ සහ කාලීන ක්‍රියාමාර්ගවල සුපරීක්ෂාකාරිත්වය අත්‍යවශ්‍ය වේ.",
    images: [
      require("../assets/Diseases/camelia.jpg"),
      require("../assets/Diseases/1.png"),
    ],
  },
  {
    name: "මුල් කුණුවීම",
    category: "දිලීර රෝග",
    symptoms: "කොළ කහ පැහැයට හැරේ, සම්පූර්ණ ශාක මැලවීම, මුල් අවර්ණ, ශාකයේ වේගවත් මරණය",
    treatment: "Rest, Fluids, Medical Care",
    description:
      "මුල් කුණුවීම යනු ශ්‍රී ලංකාවේ තේ පැලවල සමස්ත සෞඛ්‍යයට සහ ඵලදායිතාවයට සැලකිය යුතු තර්ජනයක් එල්ල කරන දිලීර රෝගයකි. මෙම රෝගය ශාකයේ මූල පද්ධතිය ඉලක්ක කරයි, මූල පටක දිරාපත්වීම හා පිරිහීමට හේතු වේ. මුල් කුණුවීමේ ආරම්භක රෝග ලක්ෂණ බොහෝ විට මැලවීම, කොළ කහ වීම සහ වර්ධනය අඩාල වීම ඇතුළත් වේ. රෝගය වර්ධනය වන විට, බලපෑමට ලක් වූ මුල් දුර්වර්ණ වී, මෘදු හා සිනිඳු වන අතර, ශාකයට ජලය සහ පෝෂ්‍ය පදාර්ථ අවශෝෂණය කිරීමේ හැකියාවට බාධා කරයි. මෙය ශක්තිය අඩුවීමට, දුර්වල වර්ධනයට සහ ශාක මරණයට පවා හේතු විය හැක. ජලයෙන් යට වූ පස සහ දුර්වල ජලාපවහනය මගින් මුල් කුණුවීම සඳහා අනුග්රහය දක්වයි, දිලීර වර්ධනයට හිතකර කොන්දේසි නිර්මානය කරයි. මුල් කුණුවීම ඵලදායී ලෙස කළමනාකරණය කිරීම සඳහා පාංශු ජලාපවහනය වැඩි දියුණු කිරීම, ශාක අතර නිසි පරතරයක් සහතික කිරීම, අධික ලෙස ජලය දැමීම වැළැක්වීම, පවතින විට රෝග-ප්‍රතිරෝධී වගාවන් භාවිතා කිරීම සහ හොඳ මූල සෞඛ්‍යය ප්‍රවර්ධනය කරන සංස්කෘතික භාවිතයන් භාවිතා කිරීම ඇතුළත් වේ. ශ්‍රී ලංකාවේ තේ පැලවල ජීව ගුණය සහ කල්පැවැත්ම ආරක්ෂා කිරීම, තේ වතුවලට මුල් කුණුවීමේ බලපෑම වැළැක්වීම සහ අවම කිරීම සඳහා කඩිනම් ක්‍රියාමාර්ග සහ වැළැක්වීමේ පියවර ඉතා වැදගත් වේ.",
    images: [
      require("../assets/Diseases/Root-Rot.jpg"),
      require("../assets/Diseases/2.jpg"),
    ],
  },
  {
    name: "තේ සලබයා",
    category: "කුරුමිණි ආසාදන",
    symptoms: "පත්‍ර පරිභෝජනය, අඩු ප්‍රභාසංස්ලේෂණය, නොමේරූ පත්‍ර වැටීම, පත්‍ර පරිභෝජනය",
    treatment: "Rest, Fluids, Antiviral Medications",
    description:
      "ශ්‍රී ලංකාවේ තේ වතු ආශ්‍රිතව බහුලව දක්නට ලැබෙන තේ සලබයා - Tea Tortrix (Homona coffearia) සලබයා තේ පැල සඳහා කැපී පෙනෙන අභියෝගයක් එල්ල කරයි. මෙම පළිබෝධකය එහි කීට අවධිය සඳහා ප්‍රසිද්ධය, සිල්ක් නූල් භාවිතයෙන් නවාතැන් නිර්මාණය කිරීම සඳහා තේ දළු පෙරළීම ඇතුළත් වේ. මෙම රෝල් කරන ලද කොළ තුළ, කීටයන් අභ්යන්තර පටක මත පෝෂණය වන අතර, අක්රමවත් හැඩැති සිදුරු හා පත්ර තුනී වීමට හේතු වේ. මෙම පෝෂණ ක්‍රියාකාරකම මගින් කොළ වල ප්‍රභාසංස්ලේෂණ හැකියාව අඩාල කළ හැකි අතර තේ ශාකයේ සමස්ත ඵලදායිතාවය අඩු විය හැක. දරුණු අවස්ථාවල දී, බලපෑමට ලක් වූ කොළ අකලට වැටීමට ඉඩ ඇති අතර, අස්වැන්න සහ ශාක සෞඛ්යය යන දෙකටම බලපායි. රෝල් කරන ලද පත්‍රවල සේද නූල් තිබීම ආසාදනය පිළිබඳ ප්‍රකාශිත ලකුණක් ලෙස සේවය කරයි. ආසාදිත කොළ කඩිනමින් කප්පාදු කිරීම සහ ඉවත් කිරීම, විශේෂඥ මගපෙන්වීම යටතේ කෘමිනාශකවල විචක්ෂණශීලී භාවිතය, ස්වභාවික විලෝපිකයන් සහ පරපෝෂිතයන් දිරිමත් කිරීම, අභිජනන ස්ථාන අවම කිරීම සඳහා නිසි සනීපාරක්ෂාව පවත්වා ගැනීම, නිරන්තර අධීක්ෂණය සහ ඒකාබද්ධ පළිබෝධ කළමනාකරණය ක්‍රියාත්මක කිරීම ඇතුළුව ඵලදායී කළමනාකරණ පිළිවෙත් ඉතා වැදගත් වේ. උපාය මාර්ග. පුළුල් ප්‍රවේශයක් අනුගමනය කිරීමෙන් තේ ගොවීන්ට ශ්‍රී ලංකාවේ තේ වතුවල ජීව ගුණය සහ ඵලදායිතාව ආරක්ෂා කරමින් තේ ටොට්‍රික්ස් උවදුරට එරෙහිව ඵලදායී ලෙස සටන් කළ හැකිය.",
    images: [
      require("../assets/Diseases/tea-tortix.jpg"),
      require("../assets/Diseases/1.png"),
    ],
  },
];
